# Query Name: Failed Logon Attempts 

# Description: 
This Splunk SPL query identifies failed Windows login attempts (`EventCode 4625`), grouped by user and host. 


index=main sourcetype=WinEventLog:Security EventCode=4625
| stats count by Account_Name, host, IpAddress

